From e.g. 

```sh
$ terraform plan \
  -var=fhir_ami=ami-00000000000000000 \ # redacted ¯\_(ツ)_/¯
  -var=etl_ami=ami-00000000000000000 \ # redacted ¯\_(ツ)_/¯
  -var=ssh_key_name=bfd-test \
  -var=git_branch_name=master \ 
  -var=git_commit_id=7765e79d08f358ac17d46dcc8b55d28c36234a59 \
  -target aws_iam_role_policy_attachment.synthea
```

```hcl
# [..snipped..]
# An execution plan has been generated and is shown below.
# Resource actions are indicated with the following symbols:
#   + create

# Terraform will perform the following actions:

  # aws_iam_policy.synthea will be created
  + resource "aws_iam_policy" "synthea" {
      + arn         = (known after apply)
      + description = "Allow the BFD Pipeline application to read-write the S3 bucket with the Synthea RIF in it."
      + id          = (known after apply)
      + name        = "bfd-test-synthea-pipeline-rw-s3-rif"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role_policy_attachment.synthea will be created
  + resource "aws_iam_role_policy_attachment" "synthea" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "bfd-test-bfd_pipeline-role"
    }

  # aws_s3_bucket.synthea will be created
  + resource "aws_s3_bucket" "synthea" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "bfd-test-synthea-etl-000000000000" # [..redacted..]
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = "BucketOwner"
      + tags                        = {
          + "Environment" = "test"
          + "Layer"       = "data"
          + "application" = "bfd"
          + "business"    = "oeda"
          + "role"        = "etl"
          + "stack"       = "test"
        }
      + tags_all                    = {
          + "Environment" = "test"
          + "Layer"       = "data"
          + "application" = "bfd"
          + "business"    = "oeda"
          + "role"        = "etl"
          + "stack"       = "test"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + logging {
          + target_bucket = "bfd-test-logs-000000000000" # [..redacted..]
          + target_prefix = "etl_s3_access_logs"
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = "arn:aws:kms:us-east-1:000000000000:key/00000000-0000-0000-0000-000000000000" # [..redacted..]
                  + sse_algorithm     = "aws:kms"
                }
            }
        }

      + versioning {
          + enabled    = false
          + mfa_delete = false
        }
    }

# Plan: 3 to add, 0 to change, 0 to destroy.
```